<a href="https://colab.research.google.com/github/simrran-sharma/MSC-IT-PART1-SEM1/blob/main/FDS/PracticalNo3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Data Preprocessing and Data Transformation

It is important to be able to extract, filter and transform data from DataFrame inorder to drill into the data that really matters. Pandas library has many techniques that makes this method efficient and intuitive.

In [ ]:
import pandas as pd
import numpy as np
cols=['col0', 'col1', 'col2', 'col3', 'col4']
rows=['row0', 'row1', 'row2', 'row3', 'row4']
data=np.random.randint(0, 100, size=(5,5))
df=pd.DataFrame(data, columns=cols, index=rows)
df.head()

      col0  col1  col2  col3  col4
row0    49    73    21    51    25
row1    79    85     5     9    10
row2    95    32    83    74    21
row3    48    83     1    18    21
row4    34    30    43    71    82

In [ ]:
df['col1']['row1']

85

In [ ]:
df.iloc[4, 2]

43

In [ ]:
df.loc['row4','col2']

43

In [ ]:
df_new=df[['col1', 'col2']]
df_new.head()

      col1  col2
row0    73    21
row1    85     5
row2    32    83
row3    83     1
row4    30    43

In [ ]:
df_new=df[['col1', 'col2']][1:4]
df_new.head(3)

      col1  col2
row1    85     5
row2    32    83
row3    83     1

In [ ]:
df['col0']
df.loc[:,'col0']
df.iloc[:, 0]

row0    49
row1    79
row2    95
row3    48
row4    34
Name: col0, dtype: int64

In [ ]:
df['col3'][2:5]

row2    74
row3    18
row4    71
Name: col3, dtype: int64

In [ ]:
df.loc['row1': 'row4',:]

      col0  col1  col2  col3  col4
row1    79    85     5     9    10
row2    95    32    83    74    21
row3    48    83     1    18    21
row4    34    30    43    71    82

In [ ]:
df.iloc[1:4, :]

      col0  col1  col2  col3  col4
row1    79    85     5     9    10
row2    95    32    83    74    21
row3    48    83     1    18    21

In [ ]:
df.loc[:,'clo1': 'col4']

      col0  col1  col2  col3  col4
row0    49    73    21    51    25
row1    79    85     5     9    10
row2    95    32    83    74    21
row3    48    83     1    18    21
row4    34    30    43    71    82

In [ ]:
df.iloc[:, 1:4]

      col1  col2  col3
row0    73    21    51
row1    85     5     9
row2    32    83    74
row3    83     1    18
row4    30    43    71

In [ ]:
df.loc['row1':'row4', 'col1':'col4']

      col1  col2  col3  col4
row1    85     5     9    10
row2    32    83    74    21
row3    83     1    18    21
row4    30    43    71    82

In [ ]:
df.iloc[1:4,1:4]

      col1  col2  col3
row1    85     5     9
row2    32    83    74
row3    83     1    18

In [ ]:
df.loc['row2':'row4', ['col1', 'col3']]

      col1  col3
row2    32    74
row3    83    18
row4    30    71

In [ ]:
df.iloc[[2,4],0:4]

      col0  col1  col2  col3
row2    95    32    83    74
row4    34    30    43    71

In [ ]:
df.head()

      col0  col1  col2  col3  col4
row0    49    73    21    51    25
row1    79    85     5     9    10
row2    95    32    83    74    21
row3    48    83     1    18    21
row4    34    30    43    71    82

In [ ]:
#Filtering Pandas
df[df['col1']>20]
condition=df['col1']>20
df[condition]

      col0  col1  col2  col3  col4
row0    49    73    21    51    25
row1    79    85     5     9    10
row2    95    32    83    74    21
row3    48    83     1    18    21
row4    34    30    43    71    82

In [ ]:
df[(df['col1']>25) & (df['col3']<30)] #logical AND

      col0  col1  col2  col3  col4
row1    79    85     5     9    10
row3    48    83     1    18    21

In [ ]:
df[(df['col1']>25) | (df['col3']<30)] #logical OR

      col0  col1  col2  col3  col4
row0    49    73    21    51    25
row1    79    85     5     9    10
row2    95    32    83    74    21
row3    48    83     1    18    21
row4    34    30    43    71    82

In [ ]:
df[~(df['col3']<30)] #Logical NOT

      col0  col1  col2  col3  col4
row0    49    73    21    51    25
row2    95    32    83    74    21
row4    34    30    43    71    82

dealing with 0 and NAN values

In [ ]:
df.iloc[3, 3]=0
df.iloc[1, 2]=np.nan
df.iloc[4, 0]=np.nan
df['col5']=0
df['col6']=np.nan
df.head()

      col0  col1  col2  col3  col4  col5  col6
row0  49.0    73  21.0    51    25     0   NaN
row1  79.0    85   NaN     9    10     0   NaN
row2  95.0    32  83.0    74    21     0   NaN
row3  48.0    83   1.0     0    21     0   NaN
row4   NaN    30  43.0    71    82     0   NaN

In [ ]:
#use all() method to select columns that don't have zero values
df.loc[:, df.all()]

      col0  col1  col2  col4  col6
row0  49.0    73  21.0    25   NaN
row1  79.0    85   NaN    10   NaN
row2  95.0    32  83.0    21   NaN
row3  48.0    83   1.0    21   NaN
row4   NaN    30  43.0    82   NaN

In [ ]:
#display column that have atleast one non zero value
df.loc[:, df.any()]

      col0  col1  col2  col3  col4
row0  49.0    73  21.0    51    25
row1  79.0    85   NaN     9    10
row2  95.0    32  83.0    74    21
row3  48.0    83   1.0     0    21
row4   NaN    30  43.0    71    82

In [ ]:
#select columns with any nan
df.loc[:,df.isnull().any()]

      col0  col2  col6
row0  49.0  21.0   NaN
row1  79.0   NaN   NaN
row2  95.0  83.0   NaN
row3  48.0   1.0   NaN
row4   NaN  43.0   NaN

In [ ]:
#select column withou nan
df.loc[:, df.notnull().all()]

      col1  col3  col4  col5
row0    73    51    25     0
row1    85     9    10     0
row2    32    74    21     0
row3    83     0    21     0
row4    30    71    82     0

In [ ]:
df.dropna(how="all", axis=1) #if all the values in columns ar enan it will be dropped

      col0  col1  col2  col3  col4  col5
row0  49.0    73  21.0    51    25     0
row1  79.0    85   NaN     9    10     0
row2  95.0    32  83.0    74    21     0
row3  48.0    83   1.0     0    21     0
row4   NaN    30  43.0    71    82     0

In [ ]:
df.dropna(how="any", axis=1) #if all the values in row are nan it will be dropped

      col1  col3  col4  col5
row0    73    51    25     0
row1    85     9    10     0
row2    32    74    21     0
row3    83     0    21     0
row4    30    71    82     0

In [ ]:
df['col1'][df['col2']>35]

row2    32
row4    30
Name: col1, dtype: int64

In [ ]:
df['col1'][df['col2']>35]+=5
df['col1']

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

row0    73
row1    85
row2    37
row3    83
row4    35
Name: col1, dtype: int64

##Transforming Dataframe

In [ ]:
def some_func(x):
  return x*2
df.apply(some_func) #update each entry of dataframe without any loop
df.apply(lambda n: n*2) #lambda also works the same

       col0  col1   col2  col3  col4  col5  col6
row0   98.0   146   42.0   102    50     0   NaN
row1  158.0   170    NaN    18    20     0   NaN
row2  190.0    74  166.0   148    42     0   NaN
row3   96.0   166    2.0     0    42     0   NaN
row4    NaN    70   86.0   142   164     0   NaN

In [ ]:
#these function do not return the transformation so we have to store it explicitly
df['new_col']=df['col4'].apply(lambda n: n*2)
df.head()

      col0  col1  col2  col3  col4  col5  col6  new_col
row0  49.0    73  21.0    51    25     0   NaN       50
row1  79.0    85   NaN     9    10     0   NaN       20
row2  95.0    37  83.0    74    21     0   NaN       42
row3  48.0    83   1.0     0    21     0   NaN       42
row4   NaN    35  43.0    71    82     0   NaN      164

In [ ]:
#if index is a string it has a .str accessor that allows us to modify entire index at once
df.index.str.upper()

Index(['ROW0', 'ROW1', 'ROW2', 'ROW3', 'ROW4'], dtype='object')

In [ ]:
#we can't use apply method on index, alternative method is map
df.index=df.index.map(str.lower)

##Transforming function in Python

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
#creating a dataframe
df=pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=['a', 'b', 'c'])

In [ ]:
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
#applying the transform function
df.transform(func = lambda x : x * 10)

    a   b   c
0  10  20  30
1  40  50  60
2  70  80  90

In [ ]:
#Demonstrate transfomr function using pandas in python
import pandas as pd
import numpy as np
import random
data = pd.DataFrame({
    'C' : [random.choice(('a','b','c')) for i in range(1000000)],
    'A' : [random.randint(1,10) for i in range(1000000)],
    'B' : [random.randint(1,10) for i in range(1000000)]

})

In [ ]:
data

        C   A  B
0       a   4  3
1       c  10  9
2       a   1  3
3       b   8  6
4       a   5  4
...    ..  .. ..
999995  a   5  7
999996  a   5  5
999997  b  10  1
999998  a   2  6
999999  c   1  5

[1000000 rows x 3 columns]

In [ ]:
#use the merge procedure
data.groupby('C')["A"].mean()
mean =data.groupby('C')["A"].mean().rename("N").reset_index()
df_1 = data.merge(mean)

In [ ]:
data['N3'] = data.groupby(['C'])['A'].transform('mean')

In [ ]:
#with apply() function

df['d'] = df.apply(lambda row: row.a + row.b + row.c, axis=1)